Ran Plan for project: `staging` dir: `terraform` workspace: `staging`

<details><summary>Show Output</summary>

```diff
+---------+------------------------------------------------------------------------------------------+-----------+---------+
| RESULT  |                                           FILE                                           | NAMESPACE | MESSAGE |
+---------+------------------------------------------------------------------------------------------+-----------+---------+
| success | /atlantis-data/repos/leandromoreirati/demodellbackstage/1/staging/terraform/main.tf      | main      | SUCCESS |
| success | /atlantis-data/repos/leandromoreirati/demodellbackstage/1/staging/terraform/outputs.tf   | main      | SUCCESS |
| success | /atlantis-data/repos/leandromoreirati/demodellbackstage/1/staging/terraform/providers.tf | main      | SUCCESS |
| success | /atlantis-data/repos/leandromoreirati/demodellbackstage/1/staging/terraform/variables.tf | main      | SUCCESS |
| success | /atlantis-data/repos/leandromoreirati/demodellbackstage/1/staging/terraform/versions.tf  | main      | SUCCESS |
| success | /atlantis-data/repos/leandromoreirati/demodellbackstage/1/staging/terraform/backend.tf   | main      | SUCCESS |
+---------+------------------------------------------------------------------------------------------+-----------+---------+

module.storage.azurerm_storage_account.default["demo"]: Refreshing state... [id=/subscriptions/a4569fe6-ace1-4216-8b6c-ba25ed31353f/resourceGroups/rg-demo/providers/Microsoft.Storage/storageAccounts/demobackstagedell]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.storage.azurerm_storage_account.default["demo"] will be created
+ resource "azurerm_storage_account" "default" {
+       access_tier                        = (known after apply)
+       account_kind                       = "StorageV2"
+       account_replication_type           = "GRS"
+       account_tier                       = "Standard"
+       allow_nested_items_to_be_public    = true
+       cross_tenant_replication_enabled   = false
+       default_to_oauth_authentication    = false
+       dns_endpoint_type                  = "Standard"
+       https_traffic_only_enabled         = true
+       id                                 = (known after apply)
+       infrastructure_encryption_enabled  = false
+       is_hns_enabled                     = false
+       large_file_share_enabled           = (known after apply)
+       local_user_enabled                 = true
+       location                           = "eastus"
+       min_tls_version                    = "TLS1_2"
+       name                               = "demodellbackstage"
+       nfsv3_enabled                      = false
+       primary_access_key                 = (sensitive value)
+       primary_blob_connection_string     = (sensitive value)
+       primary_blob_endpoint              = (known after apply)
+       primary_blob_host                  = (known after apply)
+       primary_blob_internet_endpoint     = (known after apply)
+       primary_blob_internet_host         = (known after apply)
+       primary_blob_microsoft_endpoint    = (known after apply)
+       primary_blob_microsoft_host        = (known after apply)
+       primary_connection_string          = (sensitive value)
+       primary_dfs_endpoint               = (known after apply)
+       primary_dfs_host                   = (known after apply)
+       primary_dfs_internet_endpoint      = (known after apply)
+       primary_dfs_internet_host          = (known after apply)
+       primary_dfs_microsoft_endpoint     = (known after apply)
+       primary_dfs_microsoft_host         = (known after apply)
+       primary_file_endpoint              = (known after apply)
+       primary_file_host                  = (known after apply)
+       primary_file_internet_endpoint     = (known after apply)
+       primary_file_internet_host         = (known after apply)
+       primary_file_microsoft_endpoint    = (known after apply)
+       primary_file_microsoft_host        = (known after apply)
+       primary_location                   = (known after apply)
+       primary_queue_endpoint             = (known after apply)
+       primary_queue_host                 = (known after apply)
+       primary_queue_microsoft_endpoint   = (known after apply)
+       primary_queue_microsoft_host       = (known after apply)
+       primary_table_endpoint             = (known after apply)
+       primary_table_host                 = (known after apply)
+       primary_table_microsoft_endpoint   = (known after apply)
+       primary_table_microsoft_host       = (known after apply)
+       primary_web_endpoint               = (known after apply)
+       primary_web_host                   = (known after apply)
+       primary_web_internet_endpoint      = (known after apply)
+       primary_web_internet_host          = (known after apply)
+       primary_web_microsoft_endpoint     = (known after apply)
+       primary_web_microsoft_host         = (known after apply)
+       public_network_access_enabled      = true
+       queue_encryption_key_type          = "Service"
+       resource_group_name                = "rg-demo"
+       secondary_access_key               = (sensitive value)
+       secondary_blob_connection_string   = (sensitive value)
+       secondary_blob_endpoint            = (known after apply)
+       secondary_blob_host                = (known after apply)
+       secondary_blob_internet_endpoint   = (known after apply)
+       secondary_blob_internet_host       = (known after apply)
+       secondary_blob_microsoft_endpoint  = (known after apply)
+       secondary_blob_microsoft_host      = (known after apply)
+       secondary_connection_string        = (sensitive value)
+       secondary_dfs_endpoint             = (known after apply)
+       secondary_dfs_host                 = (known after apply)
+       secondary_dfs_internet_endpoint    = (known after apply)
+       secondary_dfs_internet_host        = (known after apply)
+       secondary_dfs_microsoft_endpoint   = (known after apply)
+       secondary_dfs_microsoft_host       = (known after apply)
+       secondary_file_endpoint            = (known after apply)
+       secondary_file_host                = (known after apply)
+       secondary_file_internet_endpoint   = (known after apply)
+       secondary_file_internet_host       = (known after apply)
+       secondary_file_microsoft_endpoint  = (known after apply)
+       secondary_file_microsoft_host      = (known after apply)
+       secondary_location                 = (known after apply)
+       secondary_queue_endpoint           = (known after apply)
+       secondary_queue_host               = (known after apply)
+       secondary_queue_microsoft_endpoint = (known after apply)
+       secondary_queue_microsoft_host     = (known after apply)
+       secondary_table_endpoint           = (known after apply)
+       secondary_table_host               = (known after apply)
+       secondary_table_microsoft_endpoint = (known after apply)
+       secondary_table_microsoft_host     = (known after apply)
+       secondary_web_endpoint             = (known after apply)
+       secondary_web_host                 = (known after apply)
+       secondary_web_internet_endpoint    = (known after apply)
+       secondary_web_internet_host        = (known after apply)
+       secondary_web_microsoft_endpoint   = (known after apply)
+       secondary_web_microsoft_host       = (known after apply)
+       sftp_enabled                       = false
+       shared_access_key_enabled          = true
+       table_encryption_key_type          = "Service"
    }

Plan: 1 to add, 0 to change, 0 to destroy.


Generating Infracost cost estimates for terraform/staging...

+ infracost breakdown '--path=/atlantis-data/repos/leandromoreirati/demodellbackstage/1/staging/terraform/staging-staging.json' '--format=json' '--log-level=debug' '--out-file=/tmp/leandromoreirati-demodellbackstage-1/staging-terraform-infracost.json' --no-color
2025-02-20T03:38:22Z DEBUG IsCloudEnabled inferred from Config.EnabledDashboard is_cloud_enabled=false
2025-02-20T03:38:22Z DEBUG 'POST' request to '/graphql' using trace_id: '95d474cd-2a49-40ce-a912-8c7d51534999'
2025-02-20T03:38:22Z DEBUG performing request method POST url https://dashboard.api.infracost.io/graphql library=retryablehttp
2025-02-20T03:38:22Z DEBUG Successfully loaded settings from Infracost Cloud result="{CloudEnabled:false ActualCostsEnabled:false UsageAPIEnabled:false TagsAPIEnabled:false PoliciesAPIEnabled:false}"
2025-02-20T03:38:22Z DEBUG 'POST' request to '/graphql' using trace_id: '95d474cd-2a49-40ce-a912-8c7d51534999'
2025-02-20T03:38:22Z DEBUG performing request method POST url https://pricing.api.infracost.io/graphql library=retryablehttp
2025-02-20T03:38:23Z DEBUG os env 'ATLANTIS_WRITE_GIT_CREDS=true' matched prefix 'ATLANTIS_'
2025-02-20T03:38:23Z DEBUG fetching Atlantis VCS metadata
2025-02-20T03:38:23Z DEBUG could not get local git file changes, failed to get the previous commit to compare the current commit against, this is likely because of a shallow clone in CI error=EOF
2025-02-20T03:38:23Z INFO Autodetected 1 Terraform plan JSON file project across 1 root module
2025-02-20T03:38:23Z INFO Found Terraform plan JSON file project "-atlantis-data-repos-leandromoreirati-demodellbackstage-1-staging-terraform-staging-staging.json" at directory "/atlantis-data/repos/leandromoreirati/demodellbackstage/1/staging/terraform/staging-staging.json"
2025-02-20T03:38:23Z DEBUG Starting evaluation for project "-atlantis-data-repos-leandromoreirati-demodellbackstage-1-staging-terraform-staging-staging.json"
2025-02-20T03:38:23Z DEBUG IsCloudEnabled inferred from Config.EnabledDashboard is_cloud_enabled=false
2025-02-20T03:38:23Z DEBUG Retrieving cloud prices to calculate costs
2025-02-20T03:38:23Z DEBUG Getting pricing details for 5 cost components from https://pricing.api.infracost.io
2025-02-20T03:38:23Z DEBUG 'POST' request to '/graphql' using trace_id: '95d474cd-2a49-40ce-a912-8c7d51534999'
2025-02-20T03:38:23Z DEBUG performing request method POST url https://pricing.api.infracost.io/graphql library=retryablehttp
2025-02-20T03:38:23Z DEBUG Getting pricing details for 1 cost components from https://pricing.api.infracost.io
2025-02-20T03:38:23Z DEBUG 'POST' request to '/graphql' using trace_id: '95d474cd-2a49-40ce-a912-8c7d51534999'
2025-02-20T03:38:23Z DEBUG performing request method POST url https://pricing.api.infracost.io/graphql library=retryablehttp
2025-02-20T03:38:23Z DEBUG No products found for module.storage.azurerm_storage_account.default["demo"] Write operations, ignoring since IgnoreIfMissingPrice is set.
2025-02-20T03:38:23Z DEBUG Finished evaluation for project "-atlantis-data-repos-leandromoreirati-demodellbackstage-1-staging-terraform-staging-staging.json"
2025-02-20T03:38:23Z DEBUG IsCloudEnabled inferred from Config.EnabledDashboard is_cloud_enabled=false
2025-02-20T03:38:23Z DEBUG Skipping sending project results since Infracost Cloud upload is not enabled.
2025-02-20T03:38:23Z DEBUG 'POST' request to '/event' using trace_id: '95d474cd-2a49-40ce-a912-8c7d51534999'
2025-02-20T03:38:23Z DEBUG performing request method POST url https://pricing.api.infracost.io/event library=retryablehttp
2025-02-20T03:38:23Z INFO Output saved to /tmp/leandromoreirati-demodellbackstage-1/staging-terraform-infracost.json

Update: A new version of Infracost is available: v0.10.37 → v0.10.40
  $ curl -fsSL https://raw.githubusercontent.com/infracost/infracost/master/scripts/install.sh | sh
2025-02-20T03:38:23Z DEBUG writing 0 objects to filesystem cache
2025-02-20T03:38:23Z DEBUG could not flush pricing API cache to filesystem error="open /atlantis-data/repos/leandromoreirati/demodellbackstage/1/staging/terraform/staging-staging.json/.infracost/pricing.gob: not a directory"
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p staging
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://172.171.77.113/lock?id=leandromoreirati%252Fdemodellbackstage%252Fterraform%252Fstaging)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p staging
  ```
Plan: 1 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```